; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 734607 2 1 4 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph3 - mode
	image1 - mode
	spectrograph0 - mode
	image2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star6 - direction
	Star4 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon8 image2)
	(have_image Planet9 spectrograph3)
	(have_image Phenomenon10 image1)
	(have_image Star11 image2)
	(have_image Planet12 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 star6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
4. (turn_to satellite0 star11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star11)
   goals met: 1 of 7
5. (turn_to satellite0 groundstation5 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 7
6. (turn_to satellite1 groundstation5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 7
7. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 7
8. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 7
9. (turn_to satellite0 planet9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet9)
   goals met: 0 of 7
10. (turn_to satellite1 star6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
11. (take_image satellite0 planet9 instrument0 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 2 of 7
12. (turn_to satellite1 planet12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet12)
   goals met: 1 of 7
13. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 1 of 7
14. (take_image satellite1 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 2 of 7
15. (turn_to satellite1 star6 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star6)
   goals met: 3 of 7
16. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 4 of 7
17. (turn_to satellite0 phenomenon8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 7
18. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 7
19. (take_image satellite0 phenomenon8 instrument0 image2)
   added: (have_image phenomenon8 image2)
   goals met: 4 of 7
20. (take_image satellite1 phenomenon7 instrument1 image2)
   added: (have_image phenomenon7 image2)
   goals met: 5 of 7
21. (turn_to satellite1 star6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star6)
   goals met: 6 of 7
22. (turn_to satellite1 phenomenon10 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 7
23. (take_image satellite1 phenomenon10 instrument1 image1)
   added: (have_image phenomenon10 image1)
   goals met: 6 of 7
24. (turn_to satellite1 star6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star6)
   goals met: 7 of 7
